app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    if @car.save
---
INSERT INTO "cars" ("color", "description", "manufacturer_id", "mileage", "year") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["color", "Yellow"], ["description", ""], ["manufacturer_id", 75], ["mileage", 1000], ["year", 1925]]