app/controllers/manufacturers_controller.rb

SELECT "manufacturers".* FROM "manufacturers"
---
  def index
    @manufacturers = Manufacturer.all

INSERT INTO "manufacturers" ("country", "name") VALUES ($1, $2) RETURNING "id"  [["country", "Sweden"], ["name", "Saab"]]
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)

    if @manufacturer.save