app/views/cars/new.html.erb

SELECT "manufacturers".* FROM "manufacturers"
---
    <%= f.label :manufacturer %><br>
    <%= f.collection_select(:manufacturer_id, Manufacturer.all, :id, :name) %>